full-fastapi-test.yaml
config:
  http:
    maxSockets: 200
    timeout: 3000
  target: http://localhost:8000
  phases:
    - duration: 60
      arrivalRate: 15
    - duration: 60
      arrivalRate: 30
    - duration: 60
      arrivalRate: 40
    - duration: 60
      arrivalRate: 45
  plugins:
    expect: {}
scenarios:
  - name: Complete Order Flow with Report
    flow:
      # Step 1: Create a Category
      - post:
          url: /categories
          headers:
            Content-Type: application/json
          json:
            name: "Category_Example_{{ $uuid }}" # Unique category name
          capture:
            - json: "$.id"
              as: category_id # Save the category ID for product creation
          expect:
            statusCode: 201

      # Step 2: Create a Product
      - post:
          url: /products
          headers:
            Content-Type: application/json
          json:
            name: "Product_Example_{{ $uuid }}" # Unique product name
            description: "A sample product linked to a category."
            price: 49.99
            stock: 100
            category_id: "{{ category_id }}" # Use the captured category_id
          capture:
            - json: "$.id"
              as: product_id # Save the product ID for order creation
          expect:
            statusCode: 201

      # Step 3: Create a Customer
      - post:
          url: /customers
          headers:
            Content-Type: application/json
          json:
            name: "John Doe {{ $uuid }}" # Unique customer name
            email: "johndoe_{{ $uuid }}@example.com"
            phone: "+1234567890"
          capture:
            - json: "$.id"
              as: customer_id # Save the customer ID for order creation and report
          expect:
            statusCode: 201

      # Step 4: Create an Order
      - post:
          url: /orders
          headers:
            Content-Type: application/json
          json:
            customer_id: "{{ customer_id }}" # Use the captured customer_id
            products:
              - id: "{{ product_id }}" # Use the captured product_id
                quantity: 2
                price: 49.99
          capture:
            - json: "$.id"
              as: order_id # Save the order ID for report
          expect:
            statusCode: 201

      # Step 5: Validate the Order (Optional)
      - get:
          url: /orders/{{ order_id }}
          headers:
            Content-Type: application/json
          expect:
            statusCode: 200

      # Step 6: Get Order Report for Customer
      - get:
          url: /orders/customer/{{ customer_id }}/report
          headers:
            Content-Type: application/json
          expect:
            statusCode: 200